notes-md/20250105081013-life_2025.md

# Table of Contents

1.  [Important Notes](#orgc87ce51)
2.  [Principal Areas](#org3b90f74)
3.  [Secondary Areas](#org3fcaa4a)
4.  [Exploratory Ideas](#org174015d)
5.  [Fleeting Notes](#org66abb84)
6.  [Tools](#org1dc0c4a)
7.  [Diary](#org1b14e16)



<a id="orgc87ce51"></a>

# Important Notes

*Things to remember daily, like new philosophy*

-   Your principal hobby will be creating a game with C++


<a id="org3b90f74"></a>

# Principal Areas

*Areas that I **must** focus*

-   [Area-Backend](20250105005315-area_backend.md)
-   [Area-Trading](20250105075303-area_trading.md)


<a id="org3fcaa4a"></a>

# Secondary Areas

*Other areas that I want to explore as a hobby*

-   [Area-nixOS](20250115105430-area_nixos.md)


<a id="org174015d"></a>

# Exploratory Ideas

*Ideas that I want to explore or do*

-   Learn nix
-   Learn flake
-   learn home-manager
-   learn how to manage dotfile for reproducibility


<a id="org66abb84"></a>

# Fleeting Notes

-   [Fleeting - Tkinter](20250109060402-fleeting_tkinter.md)
-   [Fleeting - Algorithms for Computer Algebra Chapter 2](20241229075128-fleeting_algorithms_for_computer_algebra_chapter_2.md)
-   [PVM - Python works in a PVM](20250113114346-pvm_python_works_in_a_pvm.md)


<a id="org1dc0c4a"></a>

# Tools

*Files with some knowledge that I may want to revisit or check before doing something like my trading plan, study system, etc*

-   [Tool-Study System](20250105081735-tool_study_system.md)
-   [Tool-Trading Plan](20250105081815-tool_trading_plan.md)


<a id="org1b14e16"></a>

# Diary

